# AdditionalLoad Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition..::..AdditionalLoad Property
ElectricalDemandFactorDefinition Class See Also
---
Additional load to be included during demand load calculation.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double AdditionalLoad { get; set; }
```

Visual Basic
---
```text
Public Property AdditionalLoad As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AdditionalLoad {
	double get ();
	void set (double value);
}
```

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace